package rhymer

var (
	mora = map[string][]string{
		"ア": {"", "a"}, "イ": {"", "i"}, "ウ": {"", "u"}, "エ": {"", "e"}, "オ": {"", "o"},
		"カ": {"k", "a"}, "キ": {"k", "i"}, "ク": {"k", "u"}, "ケ": {"k", "e"}, "コ": {"k", "o"},
		"ガ": {"g", "a"}, "ギ": {"g", "i"}, "グ": {"g", "u"}, "ゲ": {"g", "e"}, "ゴ": {"g", "o"},
		"サ": {"s", "a"}, "シ": {"s", "i"}, "ス": {"s", "u"}, "セ": {"s", "e"}, "ソ": {"s", "o"},
		"ザ": {"z", "a"}, "ジ": {"j", "i"}, "ズ": {"z", "u"}, "ゼ": {"z", "e"}, "ゾ": {"z", "o"},
		"タ": {"t", "a"}, "チ": {"ch", "i"}, "ツ": {"ts", "u"}, "テ": {"t", "e"}, "ト": {"t", "o"},
		"ダ": {"d", "a"}, "ヂ": {"j", "i"}, "ヅ": {"z", "u"}, "デ": {"d", "e"}, "ド": {"d", "o"},
		"ナ": {"n", "a"}, "ニ": {"n", "i"}, "ヌ": {"n", "u"}, "ネ": {"n", "e"}, "ノ": {"n", "o"},
		"ハ": {"h", "a"}, "ヒ": {"h", "i"}, "フ": {"f", "u"}, "ヘ": {"h", "e"}, "ホ": {"h", "o"},
		"バ": {"b", "a"}, "ビ": {"b", "i"}, "ブ": {"b", "u"}, "ベ": {"b", "e"}, "ボ": {"b", "o"},
		"パ": {"p", "a"}, "ピ": {"p", "i"}, "プ": {"p", "u"}, "ペ": {"p", "e"}, "ポ": {"p", "o"},
		"マ": {"m", "a"}, "ミ": {"m", "i"}, "ム": {"m", "u"}, "メ": {"m", "e"}, "モ": {"m", "o"},
		"ヤ": {"y", "a"}, "ユ": {"y", "u"}, "ヨ": {"y", "o"},
		"ラ": {"r", "a"}, "リ": {"r", "i"}, "ル": {"r", "u"}, "レ": {"r", "e"}, "ロ": {"r", "o"},
		"ワ": {"w", "a"}, "ヲ": {"", "o"}, "ン": {"*n*", "*n*"},

		"キャ": {"ky", "a"}, "キュ": {"ky", "u"}, "キョ": {"ky", "o"},
		"シャ": {"sh", "a"}, "シュ": {"sh", "u"}, "ショ": {"sh", "o"},
		"チャ": {"ch", "a"}, "チュ": {"ch", "u"}, "チョ": {"ch", "o"},
		"ニャ": {"ny", "a"}, "ニュ": {"ny", "u"}, "ニョ": {"ny", "o"},
		"ヒャ": {"hy", "a"}, "ヒュ": {"hy", "u"}, "ヒョ": {"hy", "o"},
		"ミャ": {"my", "a"}, "ミュ": {"my", "u"}, "ミョ": {"my", "o"},
		"リャ": {"ry", "a"}, "リュ": {"ry", "u"}, "リョ": {"ry", "o"},
		"ギャ": {"gy", "a"}, "ギュ": {"gy", "u"}, "ギョ": {"gy", "o"},
		"ジャ": {"j", "a"}, "ジュ": {"j", "u"}, "ジョ": {"j", "o"},
		"ビャ": {"by", "a"}, "ビュ": {"by", "u"}, "ビョ": {"by", "o"},
		"ピャ": {"py", "a"}, "ピュ": {"py", "u"}, "ピョ": {"py", "o"},
		"ファ": {"f", "a"}, "フィ": {"f", "i"}, "フェ": {"f", "e"}, "フォ": {"f", "o"}, "フュ": {"fy", "u"},
		"ウィ": {"w", "i"}, "ウェ": {"w", "e"}, "ウォ": {"w", "o"},
		"ヴァ": {"v", "a"}, "ヴィ": {"v", "i"}, "ヴ": {"v", "u"}, "ヴェ": {"v", "e"}, "ヴォ": {"v", "o"},
		"ツァ": {"ts", "a"}, "ツィ": {"ts", "i"}, "ツェ": {"ts", "e"}, "ツォ": {"ts", "o"},
		"チェ": {"ch", "e"}, "シェ": {"sh", "e"}, "ジェ": {"j", "e"},
		"ティ": {"t", "i"}, "ディ": {"d", "i"},
		"デュ": {"d", "u"}, "トゥ": {"t", "u"},

		"ッ": {"*xtu*", "*xtu*"},
	}
)

func parseToMora(s string) ([][]string, bool) {
	runes := []rune(s + "$")
	length := len(runes)
	ans := make([][]string, 0, length)
	for i := 0; i < length-1; i++ {
		if v, ok := mora[string(runes[i:i+2])]; ok {
			ans = append(ans, v)
			i++
		} else if v, ok := mora[string(runes[i])]; ok {
			ans = append(ans, v)
		} else if "ー" == string(runes[i]) {
			v := make([]string, 2)
			copy(v, ans[len(ans)-1])
			v[0] = ""
			ans = append(ans, v)
		} else {
			return [][]string{}, false
		}
	}
	return ans, true
}
